Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0128GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F800670" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="6" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP6RB" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP6RB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPB" edc:desc="" edc:mask="0xffff" edc:name="CMPB" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800680" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP6BUF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP6BUF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFL" edc:desc="" edc:mask="0xffff" edc:name="BUFL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="BUFH" edc:desc="" edc:mask="0xffff" edc:name="BUFH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xffffffff" edc:name="BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800690" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x1F800700" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="7" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP7CON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="CCP7CON1" edc:nzwidth="0x20" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CCP7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOD" edc:desc="" edc:mask="0xf" edc:name="MOD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="CCSEL" edc:desc="" edc:mask="0x1" edc:name="CCSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRPS" edc:desc="" edc:mask="0x3" edc:name="TMRPS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x7" edc:name="CLKSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TMRSYNC" edc:desc="" edc:mask="0x1" edc:name="TMRSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPSLP" edc:desc="" edc:mask="0x1" edc:name="CCPSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1f" edc:name="SYNC" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="ALTSYNC" edc:desc="" edc:mask="0x1" edc:name="ALTSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="" edc:mask="0x1" edc:name="ONESHOT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPS" edc:desc="" edc:mask="0xf" edc:name="OPS" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTRGEN" edc:desc="" edc:mask="0x1" edc:name="RTRGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPSSRC" edc:desc="" edc:mask="0x1" edc:name="OPSSRC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CCP 7" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800710" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="7" edc:access="n------nnn-nnnnnnn-n----nnnnnnnn" edc:cname="CCP7CON2" edc:desc="" edc:impl="0x81dfd0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------100-0000000-0----00000000" edc:name="CCP7CON2" edc:nzwidth="0x20" edc:por="0------100-0000000-0----00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASDG" edc:desc="" edc:mask="0xff" edc:name="ASDG" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSDG" edc:desc="" edc:mask="0x1" edc:name="SSDG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ASDGM" edc:desc="" edc:mask="0x1" edc:name="ASDGM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMRSEN" edc:desc="" edc:mask="0x1" edc:name="PWMRSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICS" edc:desc="" edc:mask="0x7" edc:name="ICS" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="AUXOUT" edc:desc="" edc:mask="0x3" edc:name="AUXOUT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGSM" edc:desc="" edc:mask="0x3" edc:name="ICGSM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OCAEN" edc:desc="" edc:mask="0x1" edc:name="OCAEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OENSYNC" edc:desc="" edc:mask="0x1" edc:name="OENSYNC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800720" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="7" edc:access="nnnn------n-nn------------------" edc:cname="CCP7CON3" edc:desc="" edc:impl="0xf02c1000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000------0-00------------------" edc:name="CCP7CON3" edc:nzwidth="0x20" edc:por="0000------0-00------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PSSACE" edc:desc="" edc:mask="0x3" edc:name="PSSACE" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="POLACE" edc:desc="" edc:mask="0x1" edc:name="POLACE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OSCNT" edc:desc="" edc:mask="0x7" edc:name="OSCNT" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="OETRIG" edc:desc="" edc:mask="0x1" edc:name="OETRIG" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
