Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0128GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F80F290" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC21" edc:desc="" edc:impl="0xff3fdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00-uuuuu000uuuuu" edc:name="IPC21" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCP6IS" edc:mask="0x3" edc:name="CCP6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP6IP" edc:mask="0x7" edc:name="CCP6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT6IS" edc:mask="0x3" edc:name="CCT6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT6IP" edc:mask="0x7" edc:name="CCT6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCP7IS" edc:mask="0x3" edc:name="CCP7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP7IP" edc:mask="0x7" edc:name="CCP7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT7IS" edc:mask="0x3" edc:name="CCT7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT7IP" edc:mask="0x7" edc:name="CCT7IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F2A0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn---nnnnnnn-nnnnnnnnnnnnn" edc:cname="IPC22" edc:desc="" edc:impl="0xff62dfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu---uuuuu00-uuuuu000uuuuu" edc:name="IPC22" edc:nzwidth="32" edc:por="000xxxxx---xxxxx00-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCP8IS" edc:mask="0x3" edc:name="CCP8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP8IP" edc:mask="0x7" edc:name="CCP8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT8IS" edc:mask="0x3" edc:name="CCT8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT8IP" edc:mask="0x7" edc:name="CCT8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CCP9IS" edc:mask="0x3" edc:name="CCP9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCP9IP" edc:mask="0x7" edc:name="CCP9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCT9IS" edc:mask="0x3" edc:name="CCT9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CCT9IP" edc:mask="0x7" edc:name="CCT9IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F2B0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnn--nnnnnnnn------nnnnnnnn" edc:cname="IPC23" edc:desc="" edc:impl="0xff3fc0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000uuuuu--0uuuuu00------000uuuuu" edc:name="IPC23" edc:nzwidth="32" edc:por="000xxxxx--0xxxxx00------000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSTIS" edc:mask="0x3" edc:name="FSTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="FSTIP" edc:mask="0x7" edc:name="FSTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="NVMIS" edc:mask="0x3" edc:name="NVMIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="NVMIP" edc:mask="0x7" edc:name="NVMIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPCIS" edc:mask="0x3" edc:name="CPCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CPCIP" edc:mask="0x7" edc:name="CPCIP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F2C0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--nnnnnnnn-nnnnnnnnnnnnn---nnnnn" edc:cname="IPC24" edc:desc="" edc:impl="0x3fdfff1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0uuuuu00-uuuuu000uuuuu---00000" edc:name="IPC24" edc:nzwidth="32" edc:por="--0xxxxx00-xxxxx000xxxxx---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ECCBEIS" edc:mask="0x3" edc:name="ECCBEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ECCBEIP" edc:mask="0x7" edc:name="ECCBEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA0IS" edc:mask="0x3" edc:name="DMA0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA0IP" edc:mask="0x7" edc:name="DMA0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA1IS" edc:mask="0x3" edc:name="DMA1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA1IP" edc:mask="0x7" edc:name="DMA1IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F2D0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="-------------nnnnn-nnnnnnnnnnnnn" edc:cname="IPC25" edc:desc="" edc:impl="0xc7c7dfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------00000-uuuuu000uuuuu" edc:name="IPC25" edc:nzwidth="32" edc:por="-------------00000-xxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA2IS" edc:mask="0x3" edc:name="DMA2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA2IP" edc:mask="0x7" edc:name="DMA2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA3IS" edc:mask="0x3" edc:name="DMA3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA3IP" edc:mask="0x7" edc:name="DMA3IP" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1FC41840" edc:endaddr="0x1FC41854" edc:kseg0="0x80000000" edc:kseg1="0xA0000000" edc:ksegdef="1" edc:regionid="UDIDx">
      <edc:SFRDef edc:_addr="0x1FC41840" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID1" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1FC41844" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID2" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1FC41848" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID3" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1FC4184C" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID4" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
